package test.blackjack;

/**
 * Created by Administrator on 30.08.2017.
 */

import android.app.AlertDialog;
import android.app.Dialog;
import android.content.DialogInterface;
import android.os.Bundle;
import android.support.annotation.NonNull;
import android.support.v4.app.DialogFragment;

public class CustomDialogFragment extends DialogFragment {

    @NonNull
    public Dialog onCreateDialog(Bundle savedInstanceState) {

        AlertDialog.Builder builder=new AlertDialog.Builder(getActivity());
        return builder
                .setTitle("\tПравила игры Black Jack")

                .setMessage(
                        "В блэкджек играют против дилера. " +
                        "Поэтому основная цель заключается " +
                        "в том, чтобы собрать комбинацию карт, превосходящую руку дилера, но без перебора. Лучшая рука имеет 21 очко. Любая комбинация, сумма очков которой больше 21 автом-ки выбывает из игры.\n" +
                        "Обратите внимание, не нужно всегда набирать 21очко для того, чтобы выиграть у дилера. Для этого достаточно иметь руку, сумма очков которой, превышает общую сумму очков у дилера.\n" +
                        "\n\t\tЗначения карт в блэкджеке\n\n" +
                        "Все карты с лицами (король, дама и валет) приносят 10 очков. Туз может стоить как 1, так и 11 очков, в зависимости от того, какое значение выгоднее в данный момент. Стоимость остальных карт равна их числовому значению. Например, 3 пик принесет вам 3 очка, а 6 треф - 6 очков. Масти карт никакого отношения к их стоимости не имеет.\n" +
                        "\n\tОсновные действия в блэкджеке\n\n" +
                        "Hit (еще) - просьба добавить еще одну карту к вашей руке. Вы можете просить сколько угодно карт до тех пор, пока их сумма на будет больше или равна 21.\n" +
                        "Stand (достаточно) - этим вы сообщаете дилеру, что воздерживаетесь от дальнейших раздач.\n" +
                        "Double Down (удваиваю) - вы удваиваете свою первоначальную ставку, но после этого получите только одну карту в последующей раздаче.\n" +
                        "Split (разделить) - если при раздаче вам достались карты одинакового достоинства, то вы можете разделить их на две руки. Чтобы разделить карты, вам необходимо удвоить вашу первоначальную ставку. В дальнейшем вы будете получать от дилера по карте для каждой руки. Иногда в блэкджеке действуют ограничения на разделение карт. Например, некоторые вариации запрещают разделять пятерки или расщеплять руки более четырех раз.\n" +
                        "Surrender (сдаюсь) - после начальной раздачи, вы можете сделать выбор продолжать игру или сдаться и забрать половину исходной ставки. К сожалению, не все варианты блэкджека предлагают игроку возможность сдаться.")
                .setPositiveButton("OK", new DialogInterface.OnClickListener() {
                    public void onClick(DialogInterface dialog, int id) {
                        dialog.cancel();
                    }
                })
                .create();
    }
}